k6-testing/results/01_baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-testing/scripts/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  00.9s/10s

running (02.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  01.9s/10s

running (03.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  02.9s/10s

running (04.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  03.9s/10s

running (05.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  04.9s/10s

running (06.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  05.9s/10s

running (07.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  06.9s/10s

running (08.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  07.9s/10s

running (09.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  08.9s/10s

running (10.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  09.9s/10s


  █ THRESHOLDS 

    checks{test_type:happy_path}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{test_type:happy_path}
    ✓ 'p(95)<200' p(95)=0s


  █ TOTAL RESULTS 

    checks_total.......: 50      4.73608/s
    checks_succeeded...: 100.00% 50 out of 50
    checks_failed......: 0.00%   0 out of 50

    ✓ status is 200 (OK)

    HTTP
    http_req_duration..............: avg=42.09ms min=12.6ms med=27.29ms max=176.1ms p(90)=68.58ms p(95)=174.96ms
      { expected_response:true }...: avg=42.09ms min=12.6ms med=27.29ms max=176.1ms p(90)=68.58ms p(95)=174.96ms
      { test_type:happy_path }.....: avg=0s      min=0s     med=0s      max=0s      p(90)=0s      p(95)=0s      
    http_req_failed................: 0.00%  0 out of 52
    http_reqs......................: 52     4.925523/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1.01s  med=1.02s   max=1.17s   p(90)=1.06s   p(95)=1.17s   
    iterations.....................: 50     4.73608/s
    vus............................: 5      min=5       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 14 kB  1.3 kB/s
    data_sent......................: 5.4 kB 510 B/s



running (10.6s), 0/5 VUs, 50 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  10s