k6-testing/results/02_latency_hybrid.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-testing/scripts/latency-scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  00.8s/30s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  01.8s/30s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  02.8s/30s

running (0m04.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  03.8s/30s

running (0m05.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  04.8s/30s

running (0m06.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  05.8s/30s

running (0m07.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  06.8s/30s

running (0m08.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  07.8s/30s

running (0m09.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  08.8s/30s

running (0m10.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  09.8s/30s

running (0m11.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  10.8s/30s

running (0m12.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  11.8s/30s

running (0m13.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  12.8s/30s

running (0m14.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  13.8s/30s

running (0m15.0s), 50/50 VUs, 548 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  14.8s/30s

running (0m16.0s), 50/50 VUs, 596 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  15.8s/30s

running (0m17.0s), 50/50 VUs, 644 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  16.8s/30s

running (0m18.0s), 50/50 VUs, 694 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  17.8s/30s

running (0m19.0s), 50/50 VUs, 744 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  18.8s/30s

running (0m20.0s), 50/50 VUs, 794 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  19.8s/30s

running (0m21.0s), 50/50 VUs, 844 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  20.8s/30s

running (0m22.0s), 50/50 VUs, 894 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  21.8s/30s

running (0m23.0s), 50/50 VUs, 944 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  22.8s/30s

running (0m24.0s), 50/50 VUs, 994 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  23.8s/30s

running (0m25.0s), 50/50 VUs, 1044 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  24.8s/30s

running (0m26.0s), 50/50 VUs, 1094 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  25.8s/30s

running (0m27.0s), 50/50 VUs, 1144 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  26.8s/30s

running (0m28.0s), 50/50 VUs, 1192 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  27.8s/30s

running (0m29.0s), 50/50 VUs, 1240 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  28.8s/30s

running (0m30.0s), 50/50 VUs, 1288 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  29.8s/30s


  █ TOTAL RESULTS 

    checks_total.......: 1338   43.234355/s
    checks_succeeded...: 4.03%  54 out of 1338
    checks_failed......: 95.96% 1284 out of 1338

    ✗ status is 200 (OK)
      ↳  4% — ✓ 54 / ✗ 1284

    HTTP
    http_req_duration..............: avg=145.43ms min=2.74ms med=6.73ms max=3.32s p(90)=39.9ms p(95)=66.76ms
      { expected_response:true }...: avg=3.11s    min=8.8ms  med=3.3s   max=3.32s p(90)=3.32s  p(95)=3.32s  
    http_req_failed................: 95.74% 1284 out of 1341
    http_reqs......................: 1341   43.331293/s

    EXECUTION
    iteration_duration.............: avg=1.14s    min=1s     med=1s     max=4.33s p(90)=1.03s  p(95)=1.06s  
    iterations.....................: 1338   43.234355/s
    vus............................: 50     min=50           max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 348 kB 11 kB/s
    data_sent......................: 138 kB 4.5 kB/s



running (0m30.9s), 00/50 VUs, 1338 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s