k6-testing/results/02_latency_unprotected.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-testing/scripts/latency-scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  00.7s/30s

running (0m01.9s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  01.7s/30s

running (0m02.9s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  02.7s/30s

running (0m03.9s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.7s/30s

running (0m04.9s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  04.7s/30s

running (0m05.9s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  05.7s/30s

running (0m06.9s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  06.7s/30s

running (0m07.9s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  07.7s/30s

running (0m08.9s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  08.7s/30s

running (0m09.9s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  09.7s/30s

running (0m10.9s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  10.7s/30s

running (0m11.9s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  11.7s/30s

running (0m12.9s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  12.7s/30s

running (0m13.9s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  13.7s/30s

running (0m14.9s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  14.7s/30s

running (0m15.9s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  15.7s/30s

running (0m16.9s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  16.7s/30s

running (0m17.9s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  17.7s/30s

running (0m18.9s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  18.7s/30s

running (0m19.9s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  19.7s/30s

running (0m20.9s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  20.7s/30s

running (0m21.9s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  21.7s/30s

running (0m22.9s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  22.7s/30s

running (0m23.9s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  23.7s/30s

running (0m24.9s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  24.7s/30s

running (0m25.9s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  25.7s/30s

running (0m26.9s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  26.7s/30s

running (0m27.9s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  27.7s/30s

running (0m28.9s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  28.7s/30s

running (0m29.9s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  29.7s/30s

running (0m30.9s), 50/50 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

running (0m31.9s), 50/50 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

running (0m32.9s), 00/50 VUs, 400 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 400     12.176106/s
    checks_succeeded...: 100.00% 400 out of 400
    checks_failed......: 0.00%   0 out of 400

    ✓ status is 200 (OK)

    HTTP
    http_req_duration..............: avg=3.05s min=6.84ms med=3.01s max=3.46s p(90)=3.38s p(95)=3.43s
      { expected_response:true }...: avg=3.05s min=6.84ms med=3.01s max=3.46s p(90)=3.38s p(95)=3.43s
    http_req_failed................: 0.00%  0 out of 403
    http_reqs......................: 403    12.267426/s

    EXECUTION
    iteration_duration.............: avg=4.07s min=4s     med=4.02s max=4.46s p(90)=4.39s p(95)=4.43s
    iterations.....................: 400    12.176106/s
    vus............................: 50     min=50       max=50
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 108 kB 3.3 kB/s
    data_sent......................: 42 kB  1.3 kB/s



running (0m32.9s), 00/50 VUs, 400 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s